Ran Plan for project: `wrestleutopia-prod` dir: `accounts/wrestleutopia-prod` workspace: `default`

<details><summary>Show Output</summary>

```diff
Wrote /home/atlantis/.atlantis/prod-ue2-multiaccounts.tfvars with secrets from SSM.


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
~ update in-place

Terraform will perform the following actions:

  # aws_apigatewayv2_route.get_wrestler_by_handle will be created
+ resource "aws_apigatewayv2_route" "get_wrestler_by_handle" {
      + api_id             = "go2gft4394"
      + api_key_required   = false
      + authorization_type = "NONE"
      + id                 = (known after apply)
      + region             = "us-east-2"
      + route_key          = "GET /profiles/wrestlers/{handle}"
      + target             = "integrations/dyfsv68"
    }

  # aws_apigatewayv2_route.post_profile_avatar_presign will be created
+ resource "aws_apigatewayv2_route" "post_profile_avatar_presign" {
      + api_id             = "go2gft4394"
      + api_key_required   = false
      + authorization_type = "JWT"
      + authorizer_id      = "etl2ez"
      + id                 = (known after apply)
      + region             = "us-east-2"
      + route_key          = "POST /profiles/wrestlers/me/photo-url"
      + target             = "integrations/k0u9gvq"
    }

  # aws_apigatewayv2_route.put_wrestlers_me will be created
+ resource "aws_apigatewayv2_route" "put_wrestlers_me" {
      + api_id             = "go2gft4394"
      + api_key_required   = false
      + authorization_type = "JWT"
      + authorizer_id      = "etl2ez"
      + id                 = (known after apply)
      + region             = "us-east-2"
      + route_key          = "PUT /profiles/wrestlers/me"
      + target             = "integrations/dyfsv68"
    }

  # aws_dynamodb_table.profile_handles will be created
+ resource "aws_dynamodb_table" "profile_handles" {
      + arn              = (known after apply)
      + billing_mode     = "PAY_PER_REQUEST"
      + hash_key         = "handle"
      + id               = (known after apply)
      + name             = "wrestleutopia-ProfileHandles"
      + read_capacity    = (known after apply)
      + region           = "us-east-2"
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags_all         = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "prod"
          + "Project"     = "wrestleutopia"
        }
      + write_capacity   = (known after apply)

      + attribute {
          + name = "handle"
          + type = "S"
        }

      + point_in_time_recovery (known after apply)

      + server_side_encryption (known after apply)

      + ttl (known after apply)

      + warm_throughput (known after apply)
    }

  # aws_dynamodb_table.wrestlers will be updated in-place
~ resource "aws_dynamodb_table" "wrestlers" {
        id                          = "wrestleutopia-WrestlerProfiles"
        name                        = "wrestleutopia-WrestlerProfiles"
        tags                        = {}
        # (13 unchanged attributes hidden)

      + attribute {
          + name = "handle"
          + type = "S"
        }

      + global_secondary_index {
          + hash_key           = "handle"
          + name               = "ByHandle"
          + non_key_attributes = []
          + projection_type    = "ALL"
          + read_capacity      = (known after apply)
          + write_capacity     = (known after apply)
            # (1 unchanged attribute hidden)

          + warm_throughput (known after apply)
        }

        # (3 unchanged blocks hidden)
    }

  # aws_iam_policy.api_dynamo_policy will be updated in-place
~ resource "aws_iam_policy" "api_dynamo_policy" {
        id               = "arn:aws:iam::390402544450:policy/wrestleutopia-api-dynamo"
        name             = "wrestleutopia-api-dynamo"
      ~ policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "dynamodb:PutItem",
                          - "dynamodb:GetItem",
                          - "dynamodb:UpdateItem",
                          - "dynamodb:DeleteItem",
                          - "dynamodb:Query",
                          - "dynamodb:Scan",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:dynamodb:us-east-2:390402544450:table/wrestleutopia-WrestlerProfiles",
                          - "arn:aws:dynamodb:us-east-2:390402544450:table/wrestleutopia-PromoterProfiles",
                          - "arn:aws:dynamodb:us-east-2:390402544450:table/wrestleutopia-Tryouts",
                          - "arn:aws:dynamodb:us-east-2:390402544450:table/wrestleutopia-Tryouts/index/*",
                          - "arn:aws:dynamodb:us-east-2:390402544450:table/wrestleutopia-Applications",
                          - "arn:aws:dynamodb:us-east-2:390402544450:table/wrestleutopia-Applications/index/*",
                        ]
                      - Sid      = "CrudOnTables"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags             = {}
        # (7 unchanged attributes hidden)
    }

  # aws_lambda_function.api will be updated in-place
~ resource "aws_lambda_function" "api" {
        id                             = "wrestleutopia-api"
        tags                           = {}
        # (31 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              + "TABLE_HANDLES"   = "wrestleutopia-ProfileHandles"
                # (5 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

Plan: 4 to add, 3 to change, 0 to destroy.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p wrestleutopia-prod
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://atlantis.feedutopia.com:4141/lock?id=ryan-longoria%252FFeedUtopia%252Faccounts%252Fwrestleutopia-prod%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p wrestleutopia-prod
  ```
Plan: 4 to add, 3 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```